##  plan
```
data.aws_iam_role.task_ecs: Reading...
data.aws_vpc.default_vpc: Reading...
data.aws_iam_role.task_ecs: Read complete after 0s [id=ecsTaskExecutionRole]
data.aws_vpc.default_vpc: Read complete after 0s [id=vpc-0e41ee4b615fe2165]
module.ecs_load_balancer.data.aws_vpc.this: Reading...
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 1s [id=us-east-2]
module.ecs_load_balancer.data.aws_vpc.this: Read complete after 1s [id=vpc-0e41ee4b615fe2165]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/alpha-ecs-us-east-2-cluster"
      + retention_in_days = 7
      + tags              = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
        }
      + tags_all          = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
        }
    }

  # module.ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "project-alpha-avengers-dev-cluster"
      + tags               = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Environment"  = "dev"
          + "Identifier"   = "avengers"
          + "Name"         = "project-alpha-avengers-dev-cluster"
          + "Prefix"       = "project-alpha"
        }
      + tags_all           = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Environment"  = "dev"
          + "Identifier"   = "avengers"
          + "Name"         = "project-alpha-avengers-dev-cluster"
          + "Prefix"       = "project-alpha"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_log_group_name = "/aws/ecs/alpha-ecs-us-east-2-cluster"
                }
            }
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "project-alpha-avengers-dev-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 50
        }
      + default_capacity_provider_strategy {
          + base              = 20
          + capacity_provider = "FARGATE"
          + weight            = 50
        }
    }

  # module.ecs_load_balancer.aws_alb_target_group.this will be created
  + resource "aws_alb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "petclinic-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Environment"  = "dev"
          + "Identifier"   = "avengers"
          + "Name"         = "petclinic-target-group"
          + "Prefix"       = "project-alpha"
          + "Service"      = "petclinic"
        }
      + tags_all                           = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Environment"  = "dev"
          + "Identifier"   = "avengers"
          + "Name"         = "petclinic-target-group"
          + "Prefix"       = "project-alpha"
          + "Service"      = "petclinic"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0e41ee4b615fe2165"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # module.ecs_load_balancer.aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "petclinic-alb"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-0729965430859075f",
          + "subnet-0c8affc341e618d9f",
          + "subnet-0cfcbb3618a48f991",
        ]
      + tags                       = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Environment"  = "dev"
          + "Identifier"   = "avengers"
          + "Name"         = "petclinic-alb"
          + "Prefix"       = "project-alpha"
          + "Service"      = "petclinic"
        }
      + tags_all                   = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Environment"  = "dev"
          + "Identifier"   = "avengers"
          + "Name"         = "petclinic-alb"
          + "Prefix"       = "project-alpha"
          + "Service"      = "petclinic"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.ecs_load_balancer.aws_lb_listener.front_end will be created
  + resource "aws_lb_listener" "front_end" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Environment"  = "dev"
          + "Identifier"   = "avengers"
          + "Name"         = "project-alpha-avengers-dev-petclinic"
          + "Prefix"       = "project-alpha"
          + "Service"      = "petclinic"
        }
      + tags_all          = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Environment"  = "dev"
          + "Identifier"   = "avengers"
          + "Name"         = "project-alpha-avengers-dev-petclinic"
          + "Prefix"       = "project-alpha"
          + "Service"      = "petclinic"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.ecs_load_balancer.aws_security_group.load_balancer will be created
  + resource "aws_security_group" "load_balancer" {
      + arn                    = (known after apply)
      + description            = "ALB for service petclinic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "172.31.0.0/16",
                ]
              + description      = ""
              + from_port        = 1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "project-alpha-avengers-dev-petclinic-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0e41ee4b615fe2165"
    }

  # module.ecs_load_balancer.aws_security_group.open_to_load_balancer will be created
  + resource "aws_security_group" "open_to_load_balancer" {
      + arn                    = (known after apply)
      + description            = "Open to service: petclinic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "project-alpha-avengers-dev-petclinic--alb-open-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0e41ee4b615fe2165"
    }

  # module.ecs_service.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/project-alpha/avengers/dev/ecs-service/travelperk-app"
      + retention_in_days = 0
      + tags              = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Environment"  = "dev"
          + "Identifier"   = "avengers"
          + "Name"         = "travelperk-app"
          + "Prefix"       = "project-alpha"
        }
      + tags_all          = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Environment"  = "dev"
          + "Identifier"   = "avengers"
          + "Name"         = "travelperk-app"
          + "Prefix"       = "project-alpha"
        }
    }

  # module.ecs_service.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 3
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = false
      + health_check_grace_period_seconds  = 0
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "travelperk-app"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Environment"  = "dev"
          + "Identifier"   = "avengers"
          + "Name"         = "travelperk-app"
          + "Prefix"       = "project-alpha"
        }
      + tags_all                           = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Environment"  = "dev"
          + "Identifier"   = "avengers"
          + "Name"         = "travelperk-app"
          + "Prefix"       = "project-alpha"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "travelperk-app"
          + container_port   = 5000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-0729965430859075f",
              + "subnet-0c8affc341e618d9f",
              + "subnet-0cfcbb3618a48f991",
            ]
        }
    }

  # module.ecs_service.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command          = []
                  + cpu              = 10
                  + essential        = true
                  + image            = "karalegb/travelperk-app"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/project-alpha/avengers/dev/ecs-service/travelperk-app"
                          + awslogs-region        = "us-east-2"
                          + awslogs-stream-prefix = "alpha"
                        }
                    }
                  + memory           = 256
                  + name             = "travelperk-app"
                  + portMappings     = [
                      + {
                          + containerPort = 5000
                          + hostPort      = 5000
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::303981612052:role/ecsTaskExecutionRole"
      + family                   = "project-alpha-avengers-dev-travelperk-app"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Name"         = "project-alpha-avengers-dev-travelperk-app"
        }
      + tags_all                 = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Name"         = "project-alpha-avengers-dev-travelperk-app"
        }
      + task_role_arn            = "arn:aws:iam::303981612052:role/ecsTaskExecutionRole"

      + volume {
          + name = "data"
        }
    }

  # module.ecs_service.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Container access for ecs service: travelperk-app"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "project-alpha-avengers-dev-travelperk-app-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Name"         = "project-alpha-avengers-dev-travelperk-app-sg"
          + "ServiceName"  = "travelperk-app"
        }
      + tags_all               = {
          + "BusinessUnit" = "Research"
          + "CostCenter"   = "1000-007"
          + "Criticality"  = "Low"
          + "Data"         = "Confidential"
          + "Name"         = "project-alpha-avengers-dev-travelperk-app-sg"
          + "ServiceName"  = "travelperk-app"
        }
      + vpc_id                 = "vpc-0e41ee4b615fe2165"
    }

  # module.ecs_service.aws_security_group_rule.cluster_default_egress[0] will be created
  + resource "aws_security_group_rule" "cluster_default_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.ecs_service.aws_security_group_rule.cluster_default_ingress[0] will be created
  + resource "aws_security_group_rule" "cluster_default_ingress" {
      + cidr_blocks              = [
          + "10.0.0.0/8",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_arn                            = (known after apply)
  + cluster_autoscaling_capacity_providers = {}
  + cluster_capacity_providers             = (known after apply)
  + cluster_id                             = (known after apply)
  + cluster_name                           = "project-alpha-avengers-dev-cluster"
  + ecs_load_balancer_name                 = "petclinic-alb"
  + ecs_load_balancer_open_security_group  = (known after apply)
  + ecs_load_balancer_security_group       = (known after apply)
  + ecs_load_balancer_target_group_arn     = (known after apply)
  + ecs_service_cloudwatch_log_group       = [
      + "/project-alpha/avengers/dev/ecs-service/travelperk-app",
    ]
  + ecs_service_log_group                  = "/project-alpha/avengers/dev/ecs-service/travelperk-app"
  + ecs_service_name                       = "travelperk-app"
  + ecs_service_security_group             = (known after apply)
  + ecs_task_definition_arn                = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```